# firstroom.gd
extends Node

@onready var dialogue_box = $DialogueBox

var my_dialogue: Array = [
	"???: นี่",
	"???: เคยคิดบ้างรึเปล่า",
	"???: ว่าชีวิตของตัวเอง…",
	"???: ถูกใครควบคุมอยู่",
	"???: ...",
	"???: ตอนแรก…ฉันเคยคิดแบบนั้น",
	"???: ฉันคิดว่ามันต้องมีใครซักคนคอยบงการชีวิตของฉัน",
	"???: เอาแต่ทำให้ทุกอย่างมันแย่ลงและแย่ลงไปอีก",
	"???: ...",
	"???: เหลวไหลสิ้นดี",
	"???: ชีวิตของใครของมันสิวะ",
	"???: ทำไมต้องมายุ่งด้วยล่ะ",
	"???: ...",
	"???: ที่ฉันถามมันก็เพราะว่าสงสัยของตังเองเท่านั้นแหละ",
	"???: เอาเป็นว่า…",
	"???: สนุกกับชีวิตที่ได้มาก็พอ…"
]

func _ready():
	# เมื่อฉากโหลดเสร็จ ให้เริ่มแสดงบทพูดทันที
	dialogue_box.start_dialogue(my_dialogue)
